app/controllers/dance_teams_controller.rb

SELECT "dance_teams".* FROM "dance_teams"
---
  def index
    @dance_teams = DanceTeam.all

INSERT INTO "dance_teams" ("name", "phone", "email", "age", "HipHop", "Ballet", "Jazz", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)  [["name", ""], ["phone", ""], ["email", ""], ["age", ""], ["HipHop", ""], ["Ballet", ""], ["Jazz", ""], ["created_at", "2015-03-30 15:39:02.573320"], ["updated_at", "2015-03-30 15:39:02.573320"]]
---
  def create
    @dance_team = DanceTeam.new(dance_team_params)

    respond_to do |format|
      if @dance_team.save

UPDATE "dance_teams" SET "members" = ?, "updated_at" = ? WHERE "dance_teams"."id" = ?  [["members", 22], ["updated_at", "2015-03-30 20:28:55.824022"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @dance_team.update(dance_team_params)

DELETE FROM "dance_teams" WHERE "dance_teams"."id" = ?  [["id", 1]]
---
  def destroy
    @dance_team.destroy

SELECT  "dance_teams".* FROM "dance_teams" WHERE "dance_teams"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_dance_team
      @dance_team = DanceTeam.find(params[:id])